** FUNCTION
#+BEGIN_SRC emacs-lisp
  (defun insertR* (new old l)
    "Insert new to the right of old in a list l"
    (cond
     ((null l) ())
     ((listp (car l))
      (cons
       (insertR* new old (car l))
       (insertR* new old (cdr l))))
     (t
      (cons
       (car l)
       (cond
        ((eq old (car l))
         (cons
          new
          (insertR* new old (cdr l))))
        (t
         (insertR* new old (cdr l))))))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (princ
   (format "insert a to the right of b in (b (b) b c b): %s"
           (insertR* 'a 'b '(b (b) b c b))))
#+END_SRC

#+RESULTS:
: insert a to the right of b in (b (b) b c b): (b a (b a) b a c b a)

** TEST CALLS
#+BEGIN_SRC emacs-lisp :results output
  (princ
   (format "(a b): %d \n(a b c): %d"
           (length '(a b))
           (length '(a b c))))
#+END_SRC

#+RESULTS:
: (a b): 2 
: (a b c): 3
** TEST CALLS
#+BEGIN_SRC emacs-lisp :results output
  (princ
   (format "pick 2 from (a b): %s"
           (pick 2 '(a b))))
#+END_SRC

#+RESULTS:
: pick 2 from (a b): b

** TEST CALLS
#+BEGIN_SRC emacs-lisp :results output
  (princ
   (format "removing index 2 from (one two three) produces: %s"
           (rempick 2 '(one two three))))
  (princ
   (format "\nremoving index 3 from (one two three) produces: %s"
           (rempick 3 '(one two three))))
#+END_SRC

#+RESULTS:
: removing index 2 from (one two three) produces: (one three)
: removing index 3 from (one two three) produces: (one two)
** TEST CALLS
#+BEGIN_SRC emacs-lisp
  (princ
   (format "removing the numbers from (5 pears 6 prunes 9 dates):\n%s"
           (no-nums '(5 pears 6 prunes 9 dates))))
#+END_SRC

#+RESULTS:
: removing the numbers from (5 pears 6 prunes 9 dates):
: (pears prunes dates)
** TEST CALLS
#+BEGIN_SRC emacs-lisp
  (princ
   (format "all the numbers in (5 pears 6 prunes 9 dates is:\n%s"
           (all-nums '(5 pears 6 prunes 9 dates))))
#+END_SRC

#+RESULTS:
: all the numbers in (5 pears 6 prunes 9 dates is:
: (5 6 9)
** TEST CALLS
#+BEGIN_SRC emacs-lisp :results output
  (princ
   (format "a is in (a a a b c a): %s times"
           (occur 'a '(a a a b c a))))
#+END_SRC
#+RESULTS:
: a is in (a a a b c a): 4 times
** TEST CALLS
#+BEGIN_SRC emacs-lisp
  (princ
   (format "removing a from (a (b a) c a) produces: %s"
           (rember* 'a '(a (b a) c a))))
#+END_SRC

#+RESULTS:
: removing a from (a (b a) c a) produces: ((b) c)

** TEST CALLS
#+BEGIN_SRC emacs-lisp
  (princ
   (format "a occurs %s times in (a (a a (a a)) a)"
           (occur* 'a '(a (a a (a a) a)))))
#+END_SRC

#+RESULTS:
: a occurs 6 times in (a (a a (a a)) a)

(eq 'a (car '(a)))
** TEST CALLS
#+BEGIN_SRC emacs-lisp
  (princ
   (format "the lefmost atom of (() (a b)) is : %s\nthe lefmost atom of '(((())b) ((a) b)))) is : %s"
           (leftmost '(() (a b)))
           (leftmost '(((()())b) ((a) b)))))
#+END_SRC

#+RESULTS:
: the lefmost atom of (() (a b)) is : a
: the lefmost atom of '(((())b) ((a) b)))) is : b

